benchmarks/optimized_raw_output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6_query_load.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 3m30s max duration (incl. graceful stop):
              * query_mix: 50 looping VUs for 3m0s (gracefulStop: 30s)


Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

running (0m17.0s), 50/50 VUs, 21 complete and 0 interrupted iterations
query_mix   [   1% ] 50 VUs  0m01.0s/3m0s

running (0m18.0s), 50/50 VUs, 124 complete and 0 interrupted iterations
query_mix   [   1% ] 50 VUs  0m02.0s/3m0s

running (0m19.0s), 50/50 VUs, 251 complete and 0 interrupted iterations
query_mix   [   2% ] 50 VUs  0m03.0s/3m0s

running (0m20.0s), 50/50 VUs, 338 complete and 0 interrupted iterations
query_mix   [   2% ] 50 VUs  0m04.0s/3m0s

running (0m21.0s), 50/50 VUs, 459 complete and 0 interrupted iterations
query_mix   [   3% ] 50 VUs  0m05.0s/3m0s

running (0m22.0s), 50/50 VUs, 560 complete and 0 interrupted iterations
query_mix   [   3% ] 50 VUs  0m06.0s/3m0s

running (0m23.0s), 50/50 VUs, 652 complete and 0 interrupted iterations
query_mix   [   4% ] 50 VUs  0m07.0s/3m0s

running (0m24.0s), 50/50 VUs, 767 complete and 0 interrupted iterations
query_mix   [   4% ] 50 VUs  0m08.0s/3m0s

running (0m25.0s), 50/50 VUs, 845 complete and 0 interrupted iterations
query_mix   [   5% ] 50 VUs  0m09.0s/3m0s

running (0m26.0s), 50/50 VUs, 976 complete and 0 interrupted iterations
query_mix   [   6% ] 50 VUs  0m10.0s/3m0s

running (0m27.0s), 50/50 VUs, 1050 complete and 0 interrupted iterations
query_mix   [   6% ] 50 VUs  0m11.0s/3m0s

running (0m28.0s), 50/50 VUs, 1182 complete and 0 interrupted iterations
query_mix   [   7% ] 50 VUs  0m12.0s/3m0s

running (0m29.0s), 50/50 VUs, 1252 complete and 0 interrupted iterations
query_mix   [   7% ] 50 VUs  0m13.0s/3m0s

running (0m30.0s), 50/50 VUs, 1381 complete and 0 interrupted iterations
query_mix   [   8% ] 50 VUs  0m14.0s/3m0s

running (0m31.0s), 50/50 VUs, 1471 complete and 0 interrupted iterations
query_mix   [   8% ] 50 VUs  0m15.0s/3m0s

running (0m32.0s), 50/50 VUs, 1581 complete and 0 interrupted iterations
query_mix   [   9% ] 50 VUs  0m16.0s/3m0s

running (0m33.0s), 50/50 VUs, 1663 complete and 0 interrupted iterations
query_mix   [   9% ] 50 VUs  0m17.0s/3m0s

running (0m34.0s), 50/50 VUs, 1800 complete and 0 interrupted iterations
query_mix   [  10% ] 50 VUs  0m18.0s/3m0s

running (0m35.0s), 50/50 VUs, 1883 complete and 0 interrupted iterations
query_mix   [  11% ] 50 VUs  0m19.0s/3m0s

running (0m36.0s), 50/50 VUs, 2002 complete and 0 interrupted iterations
query_mix   [  11% ] 50 VUs  0m20.0s/3m0s

running (0m37.0s), 50/50 VUs, 2114 complete and 0 interrupted iterations
query_mix   [  12% ] 50 VUs  0m21.0s/3m0s

running (0m38.0s), 50/50 VUs, 2209 complete and 0 interrupted iterations
query_mix   [  12% ] 50 VUs  0m22.0s/3m0s

running (0m39.0s), 50/50 VUs, 2316 complete and 0 interrupted iterations
query_mix   [  13% ] 50 VUs  0m23.0s/3m0s

running (0m40.0s), 50/50 VUs, 2398 complete and 0 interrupted iterations
query_mix   [  13% ] 50 VUs  0m24.0s/3m0s

running (0m41.0s), 50/50 VUs, 2526 complete and 0 interrupted iterations
query_mix   [  14% ] 50 VUs  0m25.0s/3m0s

running (0m42.0s), 50/50 VUs, 2592 complete and 0 interrupted iterations
query_mix   [  14% ] 50 VUs  0m26.0s/3m0s

running (0m43.0s), 50/50 VUs, 2724 complete and 0 interrupted iterations
query_mix   [  15% ] 50 VUs  0m27.0s/3m0s

running (0m44.0s), 50/50 VUs, 2801 complete and 0 interrupted iterations
query_mix   [  16% ] 50 VUs  0m28.0s/3m0s

running (0m45.0s), 50/50 VUs, 2926 complete and 0 interrupted iterations
query_mix   [  16% ] 50 VUs  0m29.0s/3m0s

running (0m46.0s), 50/50 VUs, 3002 complete and 0 interrupted iterations
query_mix   [  17% ] 50 VUs  0m30.0s/3m0s

running (0m47.0s), 50/50 VUs, 3132 complete and 0 interrupted iterations
query_mix   [  17% ] 50 VUs  0m31.0s/3m0s

running (0m48.0s), 50/50 VUs, 3208 complete and 0 interrupted iterations
query_mix   [  18% ] 50 VUs  0m32.0s/3m0s

running (0m49.0s), 50/50 VUs, 3325 complete and 0 interrupted iterations
query_mix   [  18% ] 50 VUs  0m33.0s/3m0s

running (0m50.0s), 50/50 VUs, 3408 complete and 0 interrupted iterations
query_mix   [  19% ] 50 VUs  0m34.0s/3m0s

running (0m51.0s), 50/50 VUs, 3521 complete and 0 interrupted iterations
query_mix   [  19% ] 50 VUs  0m35.0s/3m0s

running (0m52.0s), 50/50 VUs, 3602 complete and 0 interrupted iterations
query_mix   [  20% ] 50 VUs  0m36.0s/3m0s

running (0m53.0s), 50/50 VUs, 3696 complete and 0 interrupted iterations
query_mix   [  21% ] 50 VUs  0m37.0s/3m0s

running (0m54.0s), 50/50 VUs, 3806 complete and 0 interrupted iterations
query_mix   [  21% ] 50 VUs  0m38.0s/3m0s

running (0m55.0s), 50/50 VUs, 3894 complete and 0 interrupted iterations
query_mix   [  22% ] 50 VUs  0m39.0s/3m0s

running (0m56.0s), 50/50 VUs, 4009 complete and 0 interrupted iterations
query_mix   [  22% ] 50 VUs  0m40.0s/3m0s

running (0m57.0s), 50/50 VUs, 4097 complete and 0 interrupted iterations
query_mix   [  23% ] 50 VUs  0m41.0s/3m0s

running (0m58.0s), 50/50 VUs, 4212 complete and 0 interrupted iterations
query_mix   [  23% ] 50 VUs  0m42.0s/3m0s

running (0m59.0s), 50/50 VUs, 4295 complete and 0 interrupted iterations
query_mix   [  24% ] 50 VUs  0m43.0s/3m0s

running (1m00.0s), 50/50 VUs, 4404 complete and 0 interrupted iterations
query_mix   [  24% ] 50 VUs  0m44.0s/3m0s

running (1m01.0s), 50/50 VUs, 4518 complete and 0 interrupted iterations
query_mix   [  25% ] 50 VUs  0m45.0s/3m0s

running (1m02.0s), 50/50 VUs, 4594 complete and 0 interrupted iterations
query_mix   [  26% ] 50 VUs  0m46.0s/3m0s

running (1m03.0s), 50/50 VUs, 4719 complete and 0 interrupted iterations
query_mix   [  26% ] 50 VUs  0m47.0s/3m0s

running (1m04.0s), 50/50 VUs, 4800 complete and 0 interrupted iterations
query_mix   [  27% ] 50 VUs  0m48.0s/3m0s

running (1m05.0s), 50/50 VUs, 4930 complete and 0 interrupted iterations
query_mix   [  27% ] 50 VUs  0m49.0s/3m0s

running (1m06.0s), 50/50 VUs, 5007 complete and 0 interrupted iterations
query_mix   [  28% ] 50 VUs  0m50.0s/3m0s

running (1m07.0s), 50/50 VUs, 5141 complete and 0 interrupted iterations
query_mix   [  28% ] 50 VUs  0m51.0s/3m0s

running (1m08.0s), 50/50 VUs, 5220 complete and 0 interrupted iterations
query_mix   [  29% ] 50 VUs  0m52.0s/3m0s

running (1m09.0s), 50/50 VUs, 5329 complete and 0 interrupted iterations
query_mix   [  29% ] 50 VUs  0m53.0s/3m0s

running (1m10.0s), 50/50 VUs, 5429 complete and 0 interrupted iterations
query_mix   [  30% ] 50 VUs  0m54.0s/3m0s

running (1m11.0s), 50/50 VUs, 5537 complete and 0 interrupted iterations
query_mix   [  31% ] 50 VUs  0m55.0s/3m0s

running (1m12.0s), 50/50 VUs, 5647 complete and 0 interrupted iterations
query_mix   [  31% ] 50 VUs  0m56.0s/3m0s

running (1m13.0s), 50/50 VUs, 5727 complete and 0 interrupted iterations
query_mix   [  32% ] 50 VUs  0m57.0s/3m0s

running (1m14.0s), 50/50 VUs, 5846 complete and 0 interrupted iterations
query_mix   [  32% ] 50 VUs  0m58.0s/3m0s

running (1m15.0s), 50/50 VUs, 5916 complete and 0 interrupted iterations
query_mix   [  33% ] 50 VUs  0m59.0s/3m0s

running (1m16.0s), 50/50 VUs, 6040 complete and 0 interrupted iterations
query_mix   [  33% ] 50 VUs  1m00.0s/3m0s

running (1m17.0s), 50/50 VUs, 6123 complete and 0 interrupted iterations
query_mix   [  34% ] 50 VUs  1m01.0s/3m0s

running (1m18.0s), 50/50 VUs, 6247 complete and 0 interrupted iterations
query_mix   [  34% ] 50 VUs  1m02.0s/3m0s

running (1m19.0s), 50/50 VUs, 6316 complete and 0 interrupted iterations
query_mix   [  35% ] 50 VUs  1m03.0s/3m0s

running (1m20.0s), 50/50 VUs, 6442 complete and 0 interrupted iterations
query_mix   [  36% ] 50 VUs  1m04.0s/3m0s

running (1m21.0s), 50/50 VUs, 6512 complete and 0 interrupted iterations
query_mix   [  36% ] 50 VUs  1m05.0s/3m0s

running (1m22.0s), 50/50 VUs, 6641 complete and 0 interrupted iterations
query_mix   [  37% ] 50 VUs  1m06.0s/3m0s

running (1m23.0s), 50/50 VUs, 6712 complete and 0 interrupted iterations
query_mix   [  37% ] 50 VUs  1m07.0s/3m0s

running (1m24.0s), 50/50 VUs, 6837 complete and 0 interrupted iterations
query_mix   [  38% ] 50 VUs  1m08.0s/3m0s

running (1m25.0s), 50/50 VUs, 6906 complete and 0 interrupted iterations
query_mix   [  38% ] 50 VUs  1m09.0s/3m0s

running (1m26.0s), 50/50 VUs, 7032 complete and 0 interrupted iterations
query_mix   [  39% ] 50 VUs  1m10.0s/3m0s

running (1m27.0s), 50/50 VUs, 7106 complete and 0 interrupted iterations
query_mix   [  39% ] 50 VUs  1m11.0s/3m0s

running (1m28.0s), 50/50 VUs, 7232 complete and 0 interrupted iterations
query_mix   [  40% ] 50 VUs  1m12.0s/3m0s

running (1m29.0s), 50/50 VUs, 7310 complete and 0 interrupted iterations
query_mix   [  41% ] 50 VUs  1m13.0s/3m0s

running (1m30.0s), 50/50 VUs, 7437 complete and 0 interrupted iterations
query_mix   [  41% ] 50 VUs  1m14.0s/3m0s

running (1m31.0s), 50/50 VUs, 7535 complete and 0 interrupted iterations
query_mix   [  42% ] 50 VUs  1m15.0s/3m0s

running (1m32.0s), 50/50 VUs, 7630 complete and 0 interrupted iterations
query_mix   [  42% ] 50 VUs  1m16.0s/3m0s

running (1m33.0s), 50/50 VUs, 7752 complete and 0 interrupted iterations
query_mix   [  43% ] 50 VUs  1m17.0s/3m0s

running (1m34.0s), 50/50 VUs, 7840 complete and 0 interrupted iterations
query_mix   [  43% ] 50 VUs  1m18.0s/3m0s

running (1m35.0s), 50/50 VUs, 7960 complete and 0 interrupted iterations
query_mix   [  44% ] 50 VUs  1m19.0s/3m0s

running (1m36.0s), 50/50 VUs, 8045 complete and 0 interrupted iterations
query_mix   [  44% ] 50 VUs  1m20.0s/3m0s

running (1m37.0s), 50/50 VUs, 8173 complete and 0 interrupted iterations
query_mix   [  45% ] 50 VUs  1m21.0s/3m0s

running (1m38.0s), 50/50 VUs, 8251 complete and 0 interrupted iterations
query_mix   [  46% ] 50 VUs  1m22.0s/3m0s

running (1m39.0s), 50/50 VUs, 8377 complete and 0 interrupted iterations
query_mix   [  46% ] 50 VUs  1m23.0s/3m0s

running (1m40.0s), 50/50 VUs, 8455 complete and 0 interrupted iterations
query_mix   [  47% ] 50 VUs  1m24.0s/3m0s

running (1m41.0s), 50/50 VUs, 8576 complete and 0 interrupted iterations
query_mix   [  47% ] 50 VUs  1m25.0s/3m0s

running (1m42.0s), 50/50 VUs, 8678 complete and 0 interrupted iterations
query_mix   [  48% ] 50 VUs  1m26.0s/3m0s

running (1m43.0s), 50/50 VUs, 8777 complete and 0 interrupted iterations
query_mix   [  48% ] 50 VUs  1m27.0s/3m0s

running (1m44.0s), 50/50 VUs, 8897 complete and 0 interrupted iterations
query_mix   [  49% ] 50 VUs  1m28.0s/3m0s

running (1m45.0s), 50/50 VUs, 8963 complete and 0 interrupted iterations
query_mix   [  49% ] 50 VUs  1m29.0s/3m0s

running (1m46.0s), 50/50 VUs, 9098 complete and 0 interrupted iterations
query_mix   [  50% ] 50 VUs  1m30.0s/3m0s

running (1m47.0s), 50/50 VUs, 9179 complete and 0 interrupted iterations
query_mix   [  51% ] 50 VUs  1m31.0s/3m0s

running (1m48.0s), 50/50 VUs, 9306 complete and 0 interrupted iterations
query_mix   [  51% ] 50 VUs  1m32.0s/3m0s

running (1m49.0s), 50/50 VUs, 9385 complete and 0 interrupted iterations
query_mix   [  52% ] 50 VUs  1m33.0s/3m0s

running (1m50.0s), 50/50 VUs, 9510 complete and 0 interrupted iterations
query_mix   [  52% ] 50 VUs  1m34.0s/3m0s

running (1m51.0s), 50/50 VUs, 9604 complete and 0 interrupted iterations
query_mix   [  53% ] 50 VUs  1m35.0s/3m0s

running (1m52.0s), 50/50 VUs, 9698 complete and 0 interrupted iterations
query_mix   [  53% ] 50 VUs  1m36.0s/3m0s

running (1m53.0s), 50/50 VUs, 9820 complete and 0 interrupted iterations
query_mix   [  54% ] 50 VUs  1m37.0s/3m0s

running (1m54.0s), 50/50 VUs, 9914 complete and 0 interrupted iterations
query_mix   [  54% ] 50 VUs  1m38.0s/3m0s

running (1m55.0s), 50/50 VUs, 10035 complete and 0 interrupted iterations
query_mix   [  55% ] 50 VUs  1m39.0s/3m0s

running (1m56.0s), 50/50 VUs, 10115 complete and 0 interrupted iterations
query_mix   [  56% ] 50 VUs  1m40.0s/3m0s

running (1m57.0s), 50/50 VUs, 10241 complete and 0 interrupted iterations
query_mix   [  56% ] 50 VUs  1m41.0s/3m0s

running (1m58.0s), 50/50 VUs, 10323 complete and 0 interrupted iterations
query_mix   [  57% ] 50 VUs  1m42.0s/3m0s

running (1m59.0s), 50/50 VUs, 10457 complete and 0 interrupted iterations
query_mix   [  57% ] 50 VUs  1m43.0s/3m0s

running (2m00.0s), 50/50 VUs, 10535 complete and 0 interrupted iterations
query_mix   [  58% ] 50 VUs  1m44.0s/3m0s

running (2m01.0s), 50/50 VUs, 10661 complete and 0 interrupted iterations
query_mix   [  58% ] 50 VUs  1m45.0s/3m0s

running (2m02.0s), 50/50 VUs, 10734 complete and 0 interrupted iterations
query_mix   [  59% ] 50 VUs  1m46.0s/3m0s

running (2m03.0s), 50/50 VUs, 10866 complete and 0 interrupted iterations
query_mix   [  59% ] 50 VUs  1m47.0s/3m0s

running (2m04.0s), 50/50 VUs, 10945 complete and 0 interrupted iterations
query_mix   [  60% ] 50 VUs  1m48.0s/3m0s

running (2m05.0s), 50/50 VUs, 11073 complete and 0 interrupted iterations
query_mix   [  61% ] 50 VUs  1m49.0s/3m0s

running (2m06.0s), 50/50 VUs, 11163 complete and 0 interrupted iterations
query_mix   [  61% ] 50 VUs  1m50.0s/3m0s

running (2m07.0s), 50/50 VUs, 11280 complete and 0 interrupted iterations
query_mix   [  62% ] 50 VUs  1m51.0s/3m0s

running (2m08.0s), 50/50 VUs, 11364 complete and 0 interrupted iterations
query_mix   [  62% ] 50 VUs  1m52.0s/3m0s

running (2m09.0s), 50/50 VUs, 11491 complete and 0 interrupted iterations
query_mix   [  63% ] 50 VUs  1m53.0s/3m0s

running (2m10.0s), 50/50 VUs, 11579 complete and 0 interrupted iterations
query_mix   [  63% ] 50 VUs  1m54.0s/3m0s

running (2m11.0s), 50/50 VUs, 11701 complete and 0 interrupted iterations
query_mix   [  64% ] 50 VUs  1m55.0s/3m0s

running (2m12.0s), 50/50 VUs, 11781 complete and 0 interrupted iterations
query_mix   [  64% ] 50 VUs  1m56.0s/3m0s

running (2m13.0s), 50/50 VUs, 11907 complete and 0 interrupted iterations
query_mix   [  65% ] 50 VUs  1m57.0s/3m0s

running (2m14.0s), 50/50 VUs, 11983 complete and 0 interrupted iterations
query_mix   [  66% ] 50 VUs  1m58.0s/3m0s

running (2m15.0s), 50/50 VUs, 12101 complete and 0 interrupted iterations
query_mix   [  66% ] 50 VUs  1m59.0s/3m0s

running (2m16.0s), 50/50 VUs, 12187 complete and 0 interrupted iterations
query_mix   [  67% ] 50 VUs  2m00.0s/3m0s

running (2m17.0s), 50/50 VUs, 12311 complete and 0 interrupted iterations
query_mix   [  67% ] 50 VUs  2m01.0s/3m0s

running (2m18.0s), 50/50 VUs, 12392 complete and 0 interrupted iterations
query_mix   [  68% ] 50 VUs  2m02.0s/3m0s

running (2m19.0s), 50/50 VUs, 12519 complete and 0 interrupted iterations
query_mix   [  68% ] 50 VUs  2m03.0s/3m0s

running (2m20.0s), 50/50 VUs, 12594 complete and 0 interrupted iterations
query_mix   [  69% ] 50 VUs  2m04.0s/3m0s

running (2m21.0s), 50/50 VUs, 12728 complete and 0 interrupted iterations
query_mix   [  69% ] 50 VUs  2m05.0s/3m0s

running (2m22.0s), 50/50 VUs, 12812 complete and 0 interrupted iterations
query_mix   [  70% ] 50 VUs  2m06.0s/3m0s

running (2m23.0s), 50/50 VUs, 12937 complete and 0 interrupted iterations
query_mix   [  71% ] 50 VUs  2m07.0s/3m0s

running (2m24.0s), 50/50 VUs, 13026 complete and 0 interrupted iterations
query_mix   [  71% ] 50 VUs  2m08.0s/3m0s

running (2m25.0s), 50/50 VUs, 13139 complete and 0 interrupted iterations
query_mix   [  72% ] 50 VUs  2m09.0s/3m0s

running (2m26.0s), 50/50 VUs, 13221 complete and 0 interrupted iterations
query_mix   [  72% ] 50 VUs  2m10.0s/3m0s

running (2m27.0s), 50/50 VUs, 13337 complete and 0 interrupted iterations
query_mix   [  73% ] 50 VUs  2m11.0s/3m0s

running (2m28.0s), 50/50 VUs, 13412 complete and 0 interrupted iterations
query_mix   [  73% ] 50 VUs  2m12.0s/3m0s

running (2m29.0s), 50/50 VUs, 13542 complete and 0 interrupted iterations
query_mix   [  74% ] 50 VUs  2m13.0s/3m0s

running (2m30.0s), 50/50 VUs, 13611 complete and 0 interrupted iterations
query_mix   [  74% ] 50 VUs  2m14.0s/3m0s

running (2m31.0s), 50/50 VUs, 13742 complete and 0 interrupted iterations
query_mix   [  75% ] 50 VUs  2m15.0s/3m0s

running (2m32.0s), 50/50 VUs, 13820 complete and 0 interrupted iterations
query_mix   [  76% ] 50 VUs  2m16.0s/3m0s

running (2m33.0s), 50/50 VUs, 13942 complete and 0 interrupted iterations
query_mix   [  76% ] 50 VUs  2m17.0s/3m0s

running (2m34.0s), 50/50 VUs, 14025 complete and 0 interrupted iterations
query_mix   [  77% ] 50 VUs  2m18.0s/3m0s

running (2m35.0s), 50/50 VUs, 14136 complete and 0 interrupted iterations
query_mix   [  77% ] 50 VUs  2m19.0s/3m0s

running (2m36.0s), 50/50 VUs, 14227 complete and 0 interrupted iterations
query_mix   [  78% ] 50 VUs  2m20.0s/3m0s

running (2m37.0s), 50/50 VUs, 14313 complete and 0 interrupted iterations
query_mix   [  78% ] 50 VUs  2m21.0s/3m0s

running (2m38.0s), 50/50 VUs, 14434 complete and 0 interrupted iterations
query_mix   [  79% ] 50 VUs  2m22.0s/3m0s

running (2m39.0s), 50/50 VUs, 14504 complete and 0 interrupted iterations
query_mix   [  79% ] 50 VUs  2m23.0s/3m0s

running (2m40.0s), 50/50 VUs, 14634 complete and 0 interrupted iterations
query_mix   [  80% ] 50 VUs  2m24.0s/3m0s

running (2m41.0s), 50/50 VUs, 14705 complete and 0 interrupted iterations
query_mix   [  81% ] 50 VUs  2m25.0s/3m0s

running (2m42.0s), 50/50 VUs, 14824 complete and 0 interrupted iterations
query_mix   [  81% ] 50 VUs  2m26.0s/3m0s

running (2m43.0s), 50/50 VUs, 14910 complete and 0 interrupted iterations
query_mix   [  82% ] 50 VUs  2m27.0s/3m0s

running (2m44.0s), 50/50 VUs, 15013 complete and 0 interrupted iterations
query_mix   [  82% ] 50 VUs  2m28.0s/3m0s

running (2m45.0s), 50/50 VUs, 15104 complete and 0 interrupted iterations
query_mix   [  83% ] 50 VUs  2m29.0s/3m0s

running (2m46.0s), 50/50 VUs, 15191 complete and 0 interrupted iterations
query_mix   [  83% ] 50 VUs  2m30.0s/3m0s

running (2m47.0s), 50/50 VUs, 15314 complete and 0 interrupted iterations
query_mix   [  84% ] 50 VUs  2m31.0s/3m0s

running (2m48.0s), 50/50 VUs, 15389 complete and 0 interrupted iterations
query_mix   [  84% ] 50 VUs  2m32.0s/3m0s

running (2m49.0s), 50/50 VUs, 15517 complete and 0 interrupted iterations
query_mix   [  85% ] 50 VUs  2m33.0s/3m0s

running (2m50.0s), 50/50 VUs, 15605 complete and 0 interrupted iterations
query_mix   [  86% ] 50 VUs  2m34.0s/3m0s

running (2m51.0s), 50/50 VUs, 15733 complete and 0 interrupted iterations
query_mix   [  86% ] 50 VUs  2m35.0s/3m0s

running (2m52.0s), 50/50 VUs, 15807 complete and 0 interrupted iterations
query_mix   [  87% ] 50 VUs  2m36.0s/3m0s

running (2m53.0s), 50/50 VUs, 15934 complete and 0 interrupted iterations
query_mix   [  87% ] 50 VUs  2m37.0s/3m0s

running (2m54.0s), 50/50 VUs, 16009 complete and 0 interrupted iterations
query_mix   [  88% ] 50 VUs  2m38.0s/3m0s

running (2m55.0s), 50/50 VUs, 16137 complete and 0 interrupted iterations
query_mix   [  88% ] 50 VUs  2m39.0s/3m0s

running (2m56.0s), 50/50 VUs, 16234 complete and 0 interrupted iterations
query_mix   [  89% ] 50 VUs  2m40.0s/3m0s

running (2m57.0s), 50/50 VUs, 16338 complete and 0 interrupted iterations
query_mix   [  89% ] 50 VUs  2m41.0s/3m0s

running (2m58.0s), 50/50 VUs, 16439 complete and 0 interrupted iterations
query_mix   [  90% ] 50 VUs  2m42.0s/3m0s

running (2m59.0s), 50/50 VUs, 16549 complete and 0 interrupted iterations
query_mix   [  91% ] 50 VUs  2m43.0s/3m0s

running (3m00.0s), 50/50 VUs, 16631 complete and 0 interrupted iterations
query_mix   [  91% ] 50 VUs  2m44.0s/3m0s

running (3m01.0s), 50/50 VUs, 16750 complete and 0 interrupted iterations
query_mix   [  92% ] 50 VUs  2m45.0s/3m0s

running (3m02.0s), 50/50 VUs, 16828 complete and 0 interrupted iterations
query_mix   [  92% ] 50 VUs  2m46.0s/3m0s

running (3m03.0s), 50/50 VUs, 16957 complete and 0 interrupted iterations
query_mix   [  93% ] 50 VUs  2m47.0s/3m0s

running (3m04.0s), 50/50 VUs, 17027 complete and 0 interrupted iterations
query_mix   [  93% ] 50 VUs  2m48.0s/3m0s

running (3m05.0s), 50/50 VUs, 17156 complete and 0 interrupted iterations
query_mix   [  94% ] 50 VUs  2m49.0s/3m0s

running (3m06.0s), 50/50 VUs, 17236 complete and 0 interrupted iterations
query_mix   [  94% ] 50 VUs  2m50.0s/3m0s

running (3m07.0s), 50/50 VUs, 17370 complete and 0 interrupted iterations
query_mix   [  95% ] 50 VUs  2m51.0s/3m0s

running (3m08.0s), 50/50 VUs, 17446 complete and 0 interrupted iterations
query_mix   [  96% ] 50 VUs  2m52.0s/3m0s

running (3m09.0s), 50/50 VUs, 17576 complete and 0 interrupted iterations
query_mix   [  96% ] 50 VUs  2m53.0s/3m0s

running (3m10.0s), 50/50 VUs, 17673 complete and 0 interrupted iterations
query_mix   [  97% ] 50 VUs  2m54.0s/3m0s

running (3m11.0s), 50/50 VUs, 17785 complete and 0 interrupted iterations
query_mix   [  97% ] 50 VUs  2m55.0s/3m0s

running (3m12.0s), 50/50 VUs, 17885 complete and 0 interrupted iterations
query_mix   [  98% ] 50 VUs  2m56.0s/3m0s

running (3m13.0s), 50/50 VUs, 17987 complete and 0 interrupted iterations
query_mix   [  98% ] 50 VUs  2m57.0s/3m0s

running (3m14.0s), 50/50 VUs, 18087 complete and 0 interrupted iterations
query_mix   [  99% ] 50 VUs  2m58.0s/3m0s

running (3m15.0s), 50/50 VUs, 18191 complete and 0 interrupted iterations
query_mix   [  99% ] 50 VUs  2m59.0s/3m0s

running (3m16.0s), 50/50 VUs, 18302 complete and 0 interrupted iterations
query_mix   [ 100% ] 50 VUs  3m00.0s/3m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 18361   93.40614/s
    checks_succeeded...: 100.00% 18361 out of 18361
    checks_failed......: 0.00%   0 out of 18361

    ✓ status is 200

    CUSTOM
    query_duration_ms..............: avg=290.37ms min=4.72ms   med=367.07ms max=890.16ms p(90)=437.71ms p(95)=457.51ms

    HTTP
    http_req_duration..............: avg=290.3ms  min=4.72ms   med=366.57ms max=890.16ms p(90)=437.67ms p(95)=457.47ms
      { expected_response:true }...: avg=290.3ms  min=4.72ms   med=366.57ms max=890.16ms p(90)=437.67ms p(95)=457.47ms
    http_req_failed................: 0.00%  0 out of 18421
    http_reqs......................: 18421  93.711372/s

    EXECUTION
    iteration_duration.............: avg=491.13ms min=205.06ms med=567.77ms max=1.09s    p(90)=638.47ms p(95)=658.29ms
    iterations.....................: 18361  93.40614/s
    vus............................: 50     min=0          max=50
    vus_max........................: 50     min=50         max=50

    NETWORK
    data_received..................: 8.1 MB 41 kB/s
    data_sent......................: 10 MB  51 kB/s



running (3m16.6s), 00/50 VUs, 18361 complete and 0 interrupted iterations
query_mix ✓ [ 100% ] 50 VUs  3m0s